examples/example_gmsh/case001/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    front
    {
        type            empty;
        physicalType    empty;
        nFaces          377642;
        startFace       632356;
    }
    back
    {
        type            empty;
        physicalType    empty;
        nFaces          377642;
        startFace       1009998;
    }
    FarField
    {
        type            patch;
        physicalType    patch;
        nFaces          192;
        startFace       1387640;
    }
    Airfoil
    {
        type            wall;
        physicalType    wall;
        nFaces          5999;
        startFace       1387832;
    }
)

// ************************************************************************* //
