examples/example_gmsh/case001/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

// kInf = 1.5 * (Uinf * I)^2   //Duda de que funcione
boundaryField
{
    FarField
    {
        type fixedValue;
        value uniform 0.54;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    Airfoil
    {
        type kqRWallFunction;
        value uniform 0;
    }
}


// ************************************************************************* //
