examples/example_gmsh/case001/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField uniform 5;

boundaryField
{
    FarField
    {
        type fixedValue;
        value uniform 5;
    }

    Airfoil
    {
        type omegaWallFunction;
        value uniform 0;
    }

    front
    {
        type empty;
    }

    back
    {
        type empty;
    }
}


// ************************************************************************* //
