examples/example_gmsh/case001/system/GMSHTOFOAM_controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  Field         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   Operation     | Version: 2212                                   |
|   \\  /    And           |                                                 |
|    \\/     Manipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     gmshToFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1;

deltaT          1;

writeControl    timeStep;
writeInterval   1;
